icc/06_clases_y_objetos.org
#+HTML_LINK_HOME: ../inicio.html
* Clases y objetos

** Definición de POO

Recordemos que la programación orientada a objetos se basa en abstraer
objetos del mundo real (o no) a valores procesables por una
computadora como lo son tipos de dato primitivos, y así crear
/objetos/.

La programación orientada a objetos (POO) requiere que se cumpla
- Abstracción
- Encapsulamiento
- Herencia
- Polimorfismo

El objetivo de tener /objetos/ es poder _separar_ funcionalidades en
objetos, donde cada uno cumple con cierta parte de un programa para
que en conjunto creen un sistema robusto. A su vez, cada objeto separa
su comportamiento en /métodos/, así es mucho más fácil leer y entender
secciones de código, divididos en métodos que si todo estuviera en el
~main~.

** Definición de Objeto

La definición de /objeto/ es la siguiente.

#+begin_verse
Un objeto es un /ente/ que tiene
- Identidad
- Propiedades o atributos
- Comportamiento
#+end_verse


En /Java/, la primera propiedad solo existe /cuando el objeto existe
en tiempo de ejecución/, que es donde aplica el concepto de
/programación orientada a objetos/.  Las otras dos propiedades se
definen /a través de una clase/, y se /añaden/ al objeto cuando este
existe. Cada objeto tendrá sus propios valores, pero compartirán la
misma categoría con sus similares.

** Clase vs Objeto

Todo esto es muy teórico, veamos un objeto práctico. Piensa por un
momento en el concepto de /persona/. Trata de visualizarlo en tu
mente. ¿Lo puedes ver a detalle? ¿Qué rostro tiene? ¿Es hombre o
mujer? ¿Qué color de piel tiene? ¿Qué color es el cabello? ¿Qué idioma
habla? ¿Cuál es la complexión de la persona?

Muchas de estas preguntas *no tienen respuesta*, ya que el concepto es
/una idea/ y las ideas /no están totalmente aterrizadas/. Esto
justamente es lo que representa una _clase_, una idea, un concepto,
una clase, que *no tiene exactamente definido su versión final*, pero
que define *qué es lo que va a tener*, en particular propiedades y
comportamiento.

Claramente sabemos que todas las personas comparten /ciertas/
características entre ellas, como extremidades, órganos vitales, sexo
entre otros; estas características comunes se definen para todos los
objetos. Y una clase crea un objeto, algo que ya existe y es
palpable.

Tomando el ejemplo de la clase Persona, piensa ahora en /Linus
Torvalds/. Todas las preguntas incógnitas ahora tienen respuesta. Esto
*ya es un objeto*. Puedes buscar quién es si todavía no sabes.

- Nombre: "Linus Benedict Torvalds"
- Rostro: "Pinguino"
- Sexo: "Hombre
- Nacionalidad: "Finlandia"
- Edad: 55+
  etc...

Similarmente, una clase en /Java/ solo define /atributos/ y /métodos/.
Y aterriza estos atributos creando o /instanciando/ el objeto con el
operador ~new~ donde no queda duda de quíen o qué es el objeto.

