icc/06_clases_y_objetos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-17 Thu 14:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Davidshiro Pichu" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="../inicio.html"> HOME </a>
</div><div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org41686dc">1. Clases y objetos</a>
<ul>
<li><a href="#org2db35d1">1.1. Definición de POO</a></li>
<li><a href="#org61130b5">1.2. Definición de Objeto</a></li>
<li><a href="#org6049938">1.3. Clase vs Objeto</a></li>
<li><a href="#org06fe7c0">1.4. Personificando objetos</a></li>
<li><a href="#org25758c3">1.5. Problema 1: Triangulo</a></li>
<li><a href="#org5b0f833">1.6. Problema 2: Coordenadas</a></li>
<li><a href="#orga35e262">1.7. Problema 3: Cuadrado</a></li>
<li><a href="#org62f448e">1.8. Problema 4: Calculadora</a></li>
<li><a href="#org6e62a1e">1.9. Problema 5: Gatos</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org41686dc" class="outline-2">
<h2 id="org41686dc"><span class="section-number-2">1.</span> Clases y objetos</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org2db35d1" class="outline-3">
<h3 id="org2db35d1"><span class="section-number-3">1.1.</span> Definición de POO</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Recordemos que la programación orientada a objetos se basa en abstraer
objetos del mundo real (o no) a valores procesables por una
computadora como lo son tipos de dato primitivos, y así crear
<i>objetos</i>.
</p>

<p>
La programación orientada a objetos (POO) requiere que se cumpla
</p>
<ul class="org-ul">
<li>Abstracción</li>
<li>Encapsulamiento</li>
<li>Herencia</li>
<li>Polimorfismo</li>
</ul>

<p>
El objetivo de tener <i>objetos</i> es poder <span class="underline">separar</span> funcionalidades en
objetos, donde cada uno cumple con cierta parte de un programa para
que en conjunto creen un sistema robusto. A su vez, cada objeto separa
su comportamiento en <i>métodos</i>, así es mucho más fácil leer y entender
secciones de código, divididos en métodos que si todo estuviera en el
<code>main</code>.
</p>
</div>
</div>
<div id="outline-container-org61130b5" class="outline-3">
<h3 id="org61130b5"><span class="section-number-3">1.2.</span> Definición de Objeto</h3>
<div class="outline-text-3" id="text-1-2">
<p>
La definición de <i>objeto</i> es la siguiente.
</p>

<p class="verse">
Un objeto es un <i>ente</i> que tiene<br />
- Identidad<br />
- Propiedades o atributos<br />
- Comportamiento<br />
</p>


<p>
En <i>Java</i>, la primera propiedad solo existe <i>cuando el objeto existe
en tiempo de ejecución</i>, que es donde aplica el concepto de
<i>programación orientada a objetos</i>.  Las otras dos propiedades se
definen <i>a través de una clase</i>, y se <i>añaden</i> al objeto cuando este
existe. Cada objeto tendrá sus propios valores, pero compartirán la
misma categoría con sus similares.
</p>
</div>
</div>
<div id="outline-container-org6049938" class="outline-3">
<h3 id="org6049938"><span class="section-number-3">1.3.</span> Clase vs Objeto</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Todo esto es muy teórico, veamos un objeto práctico. Piensa por un
momento en el concepto de <i>persona</i>. Trata de visualizarlo en tu
mente. ¿Lo puedes ver a detalle? ¿Qué rostro tiene? ¿Es hombre o
mujer? ¿Qué color de piel tiene? ¿Qué color es el cabello? ¿Qué idioma
habla? ¿Cuál es la complexión de la persona?
</p>

<p>
Muchas de estas preguntas <b>no tienen respuesta</b>, ya que el concepto es
<i>una idea</i> y las ideas <i>no están totalmente aterrizadas</i>. Esto
justamente es lo que representa una <span class="underline">clase</span>, una idea, un concepto,
una clase, que <b>no tiene exactamente definido su versión final</b>, pero
que define <b>qué es lo que va a tener</b>, en particular propiedades y
comportamiento.
</p>

<p>
Claramente sabemos que todas las personas comparten <i>ciertas</i>
características entre ellas, como extremidades, órganos vitales, sexo
entre otros; estas características comunes se definen para todos los
objetos. Y una clase crea un objeto, algo que ya existe y es
palpable.
</p>

<p>
Tomando el ejemplo de la clase Persona, piensa ahora en <i>Linus
Torvalds</i>. Todas las preguntas incógnitas ahora tienen respuesta. Esto
<b>ya es un objeto</b>. Puedes buscar quién es si todavía no sabes.
</p>

<ul class="org-ul">
<li>Nombre: "Linus Benedict Torvalds"</li>
<li>Rostro: "Pinguino"</li>
<li>Sexo: "Hombre</li>
<li>Nacionalidad: "Finlandia"</li>
<li>Edad: 55+
etc&#x2026;</li>
</ul>

<p>
Similarmente, una clase en <i>Java</i> solo define <i>atributos</i> y <i>métodos</i>.
Y aterriza estos atributos creando o <i>instanciando</i> el objeto con el
operador <code>new</code> donde no queda duda de quíen o qué es el objeto.
</p>
</div>
</div>
