icc/06_clases_y_objetos.html
<div id="outline-container-org06fe7c0" class="outline-3">
<h3 id="org06fe7c0"><span class="section-number-3">1.4.</span> Personificando objetos</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<i>Java</i> nos permite crear nuestros propias clases para poder crear
nuestros propios objetos que pueden hacer <i>cualquier cosa que
imaginemos</i>, pero que aterricemos. En <i>Java</i>, las clases se crean
siguiendo la siguiente estructura
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">class</span> [Nombre de la clase]{

    [Atributos de la clase]

    [M&#233;todos de la clase]

    [M&#233;todo main (opcional)]

}
</pre>
</div>

<p>
Veamos un ejemplo a detalle:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">import</span> <span style="color: #a2cd5a;">java</span>.<span style="color: #a2cd5a;">util</span>.<span style="color: #98f5ff;">Scanner</span>;

<span style="color: #00bfff;">public</span> <span style="color: #00bfff;">class</span> <span style="color: #98f5ff;">Persona</span> {

    <span style="color: #00bfff;">private</span> <span style="color: #98f5ff;">Scanner</span> <span style="color: #4eee94;">input</span>;
    <span style="color: #00bfff;">private</span> <span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">nombre</span>;
    <span style="color: #00bfff;">private</span> <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">edad</span>;

    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">inicializar</span>(){
        input = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Scanner</span>(System.in);
        System.out.print(<span style="color: #deb887;">"Ingresar nombre:"</span>);
        nombre = input.nextLine();
        System.out.print(<span style="color: #deb887;">"Ingresar edad:"</span>);
        edad = input.nextInt();
    }

    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">imprimir</span>(){
        System.out.println(<span style="color: #deb887;">"Nombre: "</span> + nombre);
        System.out.println(<span style="color: #deb887;">"Edad: "</span> + edad);
    }

    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">esMayorDeEdad</span>(){
        <span style="color: #00bfff;">if</span> (edad &gt;= 18){
            System.out.println(nombre + <span style="color: #deb887;">" es mayor de edad"</span>);
        } <span style="color: #00bfff;">else</span> {
            System.out.println(nombre + <span style="color: #deb887;">" no es mayor de edad"</span>);
        }
    }

    <span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">main</span>(<span style="color: #98f5ff;">String</span>[] <span style="color: #4eee94;">args</span>){
        <span style="color: #98f5ff;">Persona</span> <span style="color: #4eee94;">persona1</span>;
        persona1 = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Persona</span>();
        persona1.inicializar();
        persona1.imprimir();
        persona1.esMayorDeEdad();
    }
}
</pre>
</div>

<p>
El nombre de la clase <b>debe hacer referencia</b> al concepto que plasma
la clase. En este caso, es el concepto de persona.  Una clase <i>debería
ser siempre pública</i> para que cualquier otro objeto pueda interactuar
con éste.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">class</span> <span style="color: #98f5ff;">Persona</span> {
</pre>
</div>

<p>
Los atributos (o variables de clase) los definimos dentro de la clase,
pero afuera del <code>main</code>. Los atributos <i>siempre</i> son <b>privados</b> por la
propiedad de <i>encapsulación</i>. Nos dicen qué propiedades tendrá el
<i>objeto</i> pero no definen cuál es el valor final que tendrán. Son las
características en común que comparten todos los objetos de esta <i>clase</i>.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">private</span> <span style="color: #98f5ff;">Scanner</span> <span style="color: #4eee94;">input</span>;
<span style="color: #00bfff;">private</span> <span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">nombre</span>;
<span style="color: #00bfff;">private</span> <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">edad</span>;
</pre>
</div>

<p>
Estas variables <b>siempre</b> podrán ser accedidas desde cualquier función
o método <i>dentro</i> de la clase (salvo la función <code>main</code>).
</p>

<p>
Luego definimos los métodos, que es sinónimo de <i>comportamiento</i>. Son
muy parecidos al método <code>main</code> excepto que no tiene la cláusula
<code>static</code> y es por una buena razón que veremos más adelante.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">inicializar</span>(){
    input = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Scanner</span>(System.in);
    System.out.print(<span style="color: #deb887;">"Ingresar nombre:"</span>);
    nombre = input.nextLine();
    System.out.print(<span style="color: #deb887;">"Ingresar edad:"</span>);
    edad = input.nextInt();
}
</pre>
</div>

<p>
En el método <code>inicializar()</code>, que será el primero en ejecutar después
de crear el objeto, creamos un objeto de tipo <code>Scanner</code> a través de
<i>entrada estándar</i>, que es la que tecleamos en la terminal, y
asignamos un valor para <i>nombre</i> y <i>edad</i> <span class="underline">en tiempo de ejecución</span>, no
antes, ni aquí en la clase. <b>Notamos que todas las variables de clase
ya tienen un valor definido al terminar este método</b>.
</p>

<p>
El siguiente método <code>imprimir()</code>, imprimirá en pantalla el contenido
de los atributos de la clase, los cuales son <i>nombre</i> y <i>edad</i>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">imprimir</span>(){
    System.out.println(<span style="color: #deb887;">"Nombre: "</span> + nombre);
    System.out.println(<span style="color: #deb887;">"Edad: "</span> + edad);
}
</pre>
</div>

<p>
El tercer método tiene por objetivo saber si, dada la <i>edad</i> cargada
anteriormente corresponde a una persona mayor de edad o no.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">esMayorDeEdad</span>(){
    <span style="color: #00bfff;">if</span> (edad &gt;= 18){
        System.out.println(nombre + <span style="color: #deb887;">" es mayor de edad"</span>);
    } <span style="color: #00bfff;">else</span> {
        System.out.println(nombre + <span style="color: #deb887;">" no es mayor de edad"</span>);
    }
}
</pre>
</div>

<p>
Finalmente, tenemos el método <code>main</code> que siempre hemos puesto. Como
estamos <i>al alcance</i> de la clase <code>Persona</code>, podemos <i>instanciar</i>
objetos de la misma (estamos en el mismo archivo). Veamos línea por
línea
</p>


<p>
La declaración (también conocido como <i>firma</i>) del método es la de
siempre; indica el punto de entrada del programa.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">main</span>(<span style="color: #98f5ff;">String</span>[] <span style="color: #4eee94;">args</span>){
</pre>
</div>

<p>
Declaramos un objeto <b>de tipo</b> <code>Persona</code>. No hay nada concretado, pero
sí un <span class="underline">identificador</span> al objeto mientras esté en ejecución el
programa, en este caso es el nombre de la variable <code>persona1</code>, y debe
ser único.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">Persona</span> <span style="color: #4eee94;">persona1</span>;
</pre>
</div>

<p>
Y luego <i>instanciamos</i> el objeto, concretando sus atributos a valores
que se puedan leer y escribir.
</p>

<div class="org-src-container">
<pre class="src src-java">persona1 = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Persona</span>();
</pre>
</div>

<p>
En principio, todos los atributos de <code>Persona</code> tienen un valor por
<i>omisión</i> que <i>Java</i> asigna automáticamente, pero son valores
mínimos. La siguiente tabla muestra a qué valores asigna
automáticamente java
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tipo de dato</th>
<th scope="col" class="org-left">valor</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">int</td>
<td class="org-left">0</td>
</tr>

<tr>
<td class="org-left">boolean</td>
<td class="org-left">false</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">0.0</td>
</tr>

<tr>
<td class="org-left">String</td>
<td class="org-left">null</td>
</tr>

<tr>
<td class="org-left">Scanner</td>
<td class="org-left">null</td>
</tr>

<tr>
<td class="org-left">byte</td>
<td class="org-left">0x00</td>
</tr>
</tbody>
</table>

<p>
<b>Nota</b>: El valor <code>null</code> es equivalente a la definición de <i>vacío</i>,
existe solo para decir que no hay nada, y es usado ampliamente en las
estructuras de datos.
</p>

<p>
Así que nuestro objeto <code>persona1</code> tiene <code>nombre = null</code> y <code>edad =
0</code>, por eso el método <code>incializar()</code> asigna valores no vacíos. A
través del objeto <code>persona1</code> <i>mandamos llamar al método</i> <code>inicializar()</code>
</p>

<div class="org-src-container">
<pre class="src src-java">persona1.inicializar();
</pre>
</div>

<p>
El operador <code>.</code> <i>punto</i>, busca el <i>identificador</i> del método o
atributo <i>dentro</i> de la clase y si lo encuentra, lo ejecuta.  Por eso,
en la clase <code>String</code> utilizamos <i>métodos sobre el objeto cadena</i>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s1</span> = <span style="color: #deb887;">"hola!"</span>;
System.out.println(s1.length()); <span style="color: #7f7f7f;">//</span><span style="color: #7f7f7f;">5</span>
</pre>
</div>
<p>
Más adelante veremos cómo al momento de crear un objeto podemos
asignar valores no vacíos en lugar que <i>Java</i> los asigne
automáticamente.
</p>

<p>
El siguiente método <i>imprime</i> los valores cargados por el método
<code>inicializar()</code>
</p>
<div class="org-src-container">
<pre class="src src-java">persona1.imprimir();
</pre>
</div>

<p>
Y finalmente, saber si esta persona (<code>persona1</code>) es mayor de edad aún
cuando la variable <code>edad</code> fue definida <i>en tiempo de ejecución</i>.
</p>

<div class="org-src-container">
<pre class="src src-java">persona1.mayorDeEdad();
</pre>
</div>

<p>
Es de suma importancia que queden claro el concepto de <i>clase</i> y
<i>objeto</i> ya que es la base de toda la <i>programación orientada a
objetos</i>.
</p>
</div>
</div>
