icc/06_clases_y_objetos.org
** Problema 1: Triangulo
Crear una clase que, carge los lados de un triángulo a través de un
método ~inicializar()~. Además, debe imprimirse los atributos del
triángulo a través de un método ~imprimir()~ , así como los métodos
~ladoMayor(), ladoMenor()~ y ~esEquilatero()~ que imprime /lo que
describe el método/. El método ~main~ deberá ser el siguiente:

#+begin_src java
  public static void main (String[] args){
      Triangulo triangulo1 = new Triangulo();
      triangulo1.inicializar();
      triangulo1.imprimir();
      triangulo1.ladoMayor();
      triangulo1.ladoMenor();
      triangulo1.esEquilatero();
  }
#+end_src

** Problema 2: Coordenadas

Crear una clase que, reciba dos números enteros $x, y$ como
coordenadas del plano cartesiano a través del método ~inicializar()~.
El método ~imprime()~ deberá imprimir las coordenadas en la forma $(x,
y)$. Crear un método que nos imprima estas coordenadas $x, y$ a
coordenadas polares $(r, \theta)$; otro método que nos diga en qué
cuadrante del plano cartesiano se encuentra y finalmente otro método
que imprima el punto reflejado sobre el eje X y eje Y.

Recordemos que para transformar a coordenadas polares utilizamos
\begin{align}
r &= \sqrt{x^2 + y^2}\\
\theta &= \arctan{\frac{y}{x}}
\end{align}

** Problema 3: Cuadrado
Crear una clase que incluya el siguiente comportamiento:
+ Cargar el tamaño de un lado del cuadrado.
+ Imprimir perímetro
+ Imprimir área

** Problema 4: Calculadora
Crear un programa que cargue 2 valores decimales. Luego, imprimir:
+ suma
+ diferencia (valor absoluto de la resta)
+ multiplicación
+ división
+ exponenciación

** Problema 5: Gatos
Crea una clase que contenga los atributos que creas necesarios para
definir a un gato; estos atributos deberán ser inicializados con el
método ~inicializar()~. También crea los métodos que creas necesarios
para /expresar/ la funcionalidad del gato. Deben ser al menos 5
atributos de clase y 3 métodos /sin incluir/ ~inicializar()~ e
~imprimir()~. Manda a llamar cada uno de los métodos en el orden
correcto.
