icc/06_clases_y_objetos.html
<div id="outline-container-org25758c3" class="outline-3">
<h3 id="org25758c3"><span class="section-number-3">1.5.</span> Problema 1: Triangulo</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Crear una clase que, carge los lados de un triángulo a través de un
método <code>inicializar()</code>. Además, debe imprimirse los atributos del
triángulo a través de un método <code>imprimir()</code> , así como los métodos
<code>ladoMayor(), ladoMenor()</code> y <code>esEquilatero()</code> que imprime <i>lo que
describe el método</i>. El método <code>main</code> deberá ser el siguiente:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">main</span> (<span style="color: #98f5ff;">String</span>[] <span style="color: #4eee94;">args</span>){
    <span style="color: #98f5ff;">Triangulo</span> <span style="color: #4eee94;">triangulo1</span> = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Triangulo</span>();
    triangulo1.inicializar();
    triangulo1.imprimir();
    triangulo1.ladoMayor();
    triangulo1.ladoMenor();
    triangulo1.esEquilatero();
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org5b0f833" class="outline-3">
<h3 id="org5b0f833"><span class="section-number-3">1.6.</span> Problema 2: Coordenadas</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Crear una clase que, reciba dos números enteros \(x, y\) como
coordenadas del plano cartesiano a través del método <code>inicializar()</code>.
El método <code>imprime()</code> deberá imprimir las coordenadas en la forma \((x,
y)\). Crear un método que nos imprima estas coordenadas \(x, y\) a
coordenadas polares \((r, \theta)\); otro método que nos diga en qué
cuadrante del plano cartesiano se encuentra y finalmente otro método
que imprima el punto reflejado sobre el eje X y eje Y.
</p>

<p>
Recordemos que para transformar a coordenadas polares utilizamos
</p>
\begin{align}
r &= \sqrt{x^2 + y^2}\\
\theta &= \arctan{\frac{y}{x}}
\end{align}
</div>
</div>
<div id="outline-container-orga35e262" class="outline-3">
<h3 id="orga35e262"><span class="section-number-3">1.7.</span> Problema 3: Cuadrado</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Crear una clase que incluya el siguiente comportamiento:
</p>
<ul class="org-ul">
<li>Cargar el tamaño de un lado del cuadrado.</li>
<li>Imprimir perímetro</li>
<li>Imprimir área</li>
</ul>
</div>
</div>
<div id="outline-container-org62f448e" class="outline-3">
<h3 id="org62f448e"><span class="section-number-3">1.8.</span> Problema 4: Calculadora</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Crear un programa que cargue 2 valores decimales. Luego, imprimir:
</p>
<ul class="org-ul">
<li>suma</li>
<li>diferencia (valor absoluto de la resta)</li>
<li>multiplicación</li>
<li>división</li>
<li>exponenciación</li>
</ul>
</div>
</div>
<div id="outline-container-org6e62a1e" class="outline-3">
<h3 id="org6e62a1e"><span class="section-number-3">1.9.</span> Problema 5: Gatos</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Crea una clase que contenga los atributos que creas necesarios para
definir a un gato; estos atributos deberán ser inicializados con el
método <code>inicializar()</code>. También crea los métodos que creas necesarios
para <i>expresar</i> la funcionalidad del gato. Deben ser al menos 5
atributos de clase y 3 métodos <i>sin incluir</i> <code>inicializar()</code> e
<code>imprimir()</code>. Manda a llamar cada uno de los métodos en el orden
correcto.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Davidshiro Pichu</p>
<p class="date">Created: 2025-07-17 Thu 14:52</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
